from task5 import gylbertMyr, LZ77

input_prob_1 = [0.355, 0.03, 0.01, 0.1, 0.28, 0.073, 0.034, 0.046, 0.018, 0.054]
input_prob_2 = [0.164, 0.16, 0.185, 0.185, 0.13, 0.07, 0.028, 0.018, 0.01, 0.05]
input_prob_3 = [0.274, 0.09, 0.1, 0.115, 0.19, 0.09, 0.034, 0.022, 0.025, 0.06]
input_prob_att = [0.279, 0.25, 0.11, 0.08, 0.07, 0.055, 0.054, 0.038, 0.034, 0.03]

message_1 = 'ПРОТОКОЛ_ПРО_ПРОТОКОЛ_ПРОТОКОЛОМ_ЗАПРОТОКОЛИРОВАЛИ'
message_2 = 'У_ОСЫ_НЕ_УСЫ_И_НЕ_УСИЩА,_А_УСИКИ'

gylbertMyr.print_output(input_prob_3)
LZ77.print_output(message_2)
